БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПланыЛечения/ПланыЛечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланыЛечения</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>удалитьДокументРегистратор</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </resources>
  <resources>
    <name>ПриемовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дозировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПервичныйПрием</name>
    <comment>Документ, созданный первым в рамках одного обращения пациента</comment>
    <type>
      <types>DefinedType.ПервичныйПрием</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЭлемента</name>
    <comment>Собственный идентификатор элемента плана лечения</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыНазначений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
      <types>CatalogRef.Номенклатура</types>
      <types>String</types>
      <types>CatalogRef.КатегорииВыработки</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядокЭлемента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ВыполнениеПланаЛечения/ВыполнениеПланаЛечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеПланаЛечения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПервичныйПрием</name>
    <comment>Документ, созданный первым в рамках одного обращения пациента</comment>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЭлемента</name>
    <comment>Собственный идентификатор элемента плана лечения</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенесенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДляОтката</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХочуРаньше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеХочуРаньше</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборХочуРаньше</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗаписиВРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДлительностиЗаявки</name>
    <type>
      <types>EnumRef.РежимДлительностиЗаявки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование1</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование2</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование3</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьИзмененаВручную</name>
      <comment>Используется в форме заявки при установке нормативной продолжительности</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыХочуРаньше</name>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/CommonForms/ФормаЗапланированныеПроцедуры/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Клиент = Параметры.Клиент;
	ЗаполнитьСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаНазначений.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() <> 0 Тогда
		
		ТекущиеДанные = ТаблицаНазначений.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Клиент", Клиент);
		ДанныеЗаполнения.Вставить("Сотрудник", ТекущиеДанные.Врач);
		
		ДанныеЗаполнения.Вставить("Работы", Новый Массив);
		
		Для Каждого ВыделеннаяСтрока Из Элементы.ТаблицаНазначений.ВыделенныеСтроки Цикл
			ДанныеСтроки = ТаблицаНазначений.НайтиПоИдентификатору(ВыделеннаяСтрока);
			Если ЗначениеЗаполнено(ДанныеСтроки.Услуга) Тогда
				СтруктураУслуги = Новый Структура("Номенклатура, Сотрудник", ДанныеСтроки.Услуга, ДанныеСтроки.Врач);
				ДанныеЗаполнения.Работы.Добавить(СтруктураУслуги);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
		ОткрытьФорму("Документ.Заявка.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ПланыЛечения.Номенклатура ССЫЛКА Справочник.Номенклатура
				|			ТОГДА ПланыЛечения.Номенклатура
				|		ИНАЧЕ NULL
				|	КОНЕЦ КАК Услуга,
				|	ВЫБОР
				|		КОГДА ПланыЛечения.Номенклатура ССЫЛКА Справочник.Номенклатура
				|			ТОГДА ПланыЛечения.Номенклатура.КатегорияВыработки
				|		ИНАЧЕ ПланыЛечения.Номенклатура
				|	КОНЕЦ КАК Специализация,
				|	ПланыЛечения.Дата КАК Дата,
				|	ПланыЛечения.Сотрудник КАК Врач,
				|	ПланыЛечения.Количество КАК Количество,
				|	ПланыЛечения.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
				|	ПланыЛечения.ПервичныйПрием КАК ПервичныйПрием
				|ПОМЕСТИТЬ ПланыЛечения
				|ИЗ
				|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
				|ГДЕ
				|	ИСТИНА
				|	И ПланыЛечения.ДокументРегистратор В(&МассивПриемов)
				|	И ПланыЛечения.Дата <= &Дата
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПланыЛечения.Услуга КАК Услуга,
				|	ПланыЛечения.Специализация КАК Специализация,
				|	ПланыЛечения.Дата КАК Дата,
				|	ПланыЛечения.Врач КАК Врач,
				|	ПланыЛечения.Количество - СУММА(ЕСТЬNULL(ВыполнениеПланаЛечения.Количество, 0)) КАК Количество
				|ИЗ
				|	ПланыЛечения КАК ПланыЛечения
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыполнениеПланаЛечения КАК ВыполнениеПланаЛечения
				|		ПО ПланыЛечения.ИдентификаторЭлемента = ВыполнениеПланаЛечения.ИдентификаторЭлемента
				|			И ПланыЛечения.ПервичныйПрием = ВыполнениеПланаЛечения.ПервичныйПрием
				|
				|СГРУППИРОВАТЬ ПО
				|	ПланыЛечения.Услуга,
				|	ПланыЛечения.Специализация,
				|	ПланыЛечения.Дата,
				|	ПланыЛечения.Врач,
				|	ПланыЛечения.Количество
				|
				|ИМЕЮЩИЕ
				|	СУММА(ВыполнениеПланаЛечения.Количество) < ПланыЛечения.Количество";
	
	Если Дата = Дата("00010101") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ПланыЛечения.Дата <= &Дата","");
	Иначе
		Запрос.УстановитьПараметр("Дата", Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		ЗапросПриемы = Новый Запрос;
		ЗапросПриемы.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Прием.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Прием КАК Прием
	               |ГДЕ
	               |	Прием.Клиент = &Клиент";
		ЗапросПриемы.УстановитьПараметр("Клиент", Клиент);
		МассивПриемов = ЗапросПриемы.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

		Запрос.УстановитьПараметр("МассивПриемов", МассивПриемов);
		ТаблицаНазначений.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		ТаблицаНазначений.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	ЗаполнитьСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьСервер();
КонецПроцедуры

#КонецОбласти
